// 11. Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.
// Цикл должен спрашивать число пока либо посетитель не введёт число, большее 100, либо не нажмёт кнопку Отмена (ESC).
// Предполагается, что посетитель вводит только числа. Предусматривать обработку нечисловых строк в этой задаче необязательно.
var num = +prompt("введите число больше 100");
var esc = null;
while (num < 100) {  
    alert ("Ведите еще раз");
    var num = +prompt("введите число больше 100");
    if (num === esc) {
        break;
    }
}